In [567]:
import pandas as pd
import numpy as np

In [ ]:
print("The primary demographic is males ages 20-24.")
print("Even the biggest spenders buy very few quantities of add-ons.")
print("I would consider lowering prices to earn more from volume.")

In [568]:
file1 = "purchase_data.json"
file2 = "purchase_data2.json"

In [569]:
heroe_df1 = pd.read_json(file1)
heroe_df2 = pd.read_json(file2)
heroe_df1.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [570]:
heroe_df2.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [571]:
heroe_df = pd.concat([heroe_df1, heroe_df2], ignore_index=True)

In [572]:
heroe_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [573]:
player_count = len(heroe_df["SN"].unique())
print("There are " + str(player_count) + " players")

There are 612 players

In [574]:
total_revenue = heroe_df["Price"].sum()
print("The total revenue is " + str(total_revenue))

The total revenue is 2514.4299999999967

In [575]:
sales_count = heroe_df["SN"].count()
print("The total number of sales is " + str(sales_count))

The total number of sales is 858

In [576]:
unique_items = len(heroe_df["Item ID"].unique())
print("The number of unique items is " + str(unique_items))

The number of unique items is 184

In [577]:
avg_pp = heroe_df["Price"].sum()/heroe_df["Price"].count()
print("The average purchase price is " + str(avg_pp))

The average purchase price is 2.93057109557

In [578]:
male_df = heroe_df.loc[heroe_df["Gender"] =="Male"]
male_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [579]:
female_df = heroe_df.loc[heroe_df["Gender"]=="Female"]
female_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
7,29,Female,169,"Interrogator, Blood Blade of the Queen",3.32,Iathenudil29
16,22,Female,123,Twilight's Carver,1.14,Sundista85
17,22,Female,59,"Lightning, Etcher of the King",1.65,Aenarap34
22,11,Female,11,Brimstone,2.52,Deural48
29,16,Female,45,Glinting Glass Edge,2.46,Phaedai25

In [580]:
other_df = heroe_df.loc[heroe_df["Gender"]=="Other / Non-Disclosed"]
other_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
177,34,Other / Non-Disclosed,155,War-Forged Gold Deflector,3.73,Assassa38
209,33,Other / Non-Disclosed,157,"Spada, Etcher of Hatred",2.21,Frichistasta59
244,21,Other / Non-Disclosed,183,Dragon's Greatsword,2.36,Tyaerith73
267,33,Other / Non-Disclosed,65,Conqueror Adamantite Mace,1.96,Frichistasta59
276,12,Other / Non-Disclosed,128,"Blazeguard, Reach of Eternity",4.00,Aillycal84

In [581]:
male_cnt = len((male_df["SN"]).unique())
male_pct = (male_cnt/player_count)*100
female_cnt = len((female_df["SN"]).unique())
female_pct = (female_cnt/player_count)*100
other_cnt = len((other_df["SN"]).unique())
other_pct = (other_cnt/player_count)*100

print("There are {} players, including {} males ({}%), {} females ({}%), and {} others ({}%),".format(player_count, male_cnt, male_pct, female_cnt, female_pct, other_cnt, other_pct))

There are 612 players, including 498 males (81.37254901960785%), 112 females (18.30065359477124%), and 9 others (1.4705882352941175%),

In [582]:
male_sales = male_df["SN"].count()
male_sum = male_df["Price"].sum()
male_avg = male_sum/male_sales
print("There were {} sales to men, averaging ${}, and totaling ${}".format(male_sales, male_avg, male_sum))

There were 697 sales to men, averaging $2.944447632711619, and totaling $2052.2799999999984

In [583]:
female_sales = female_df["SN"].count()
female_sum = female_df["Price"].sum()
female_avg = female_sum/female_sales
print("There were {} sales to females, averaging ${}, and totaling ${}".format(female_sales, female_avg, female_sum))

There were 149 sales to females, averaging $2.8475838926174477, and totaling $424.28999999999974

In [584]:
other_sales = other_df["SN"].count()
other_sum = other_df["Price"].sum()
other_avg = other_sum/other_sales
print("There were {} sales to others, averaging ${}, and totaling ${}".format(other_sales, other_avg, other_sum))

There were 12 sales to others, averaging $3.1549999999999994, and totaling $37.85999999999999

In [585]:
player_df = heroe_df#.drop_duplicates(["SN"], keep='last')
player_df["SN"].count()
bins = [0, 9, 14, 19, 24, 29, 34, 39, 44, 49]
group_names = ['0-9', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40-44', '45-49']
pd.cut(player_df["Age"], bins, labels=group_names)
player_df["Age Demographic"] = pd.cut(player_df["Age"], bins, labels=group_names)
player_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Demographic
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35-39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30-34
3,21,Male,92,Final Critic,1.36,Pheusrical25,20-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20-24

In [586]:
group_df = player_df
price_sum = group_df.groupby("Age Demographic")["Price"].sum()
price_sum.head()

Age Demographic
0-9        97.28
10-14     105.91
15-19     416.83
20-24    1087.66
25-29     396.44
Name: Price, dtype: float64

In [587]:
price_cnt = group_df.groupby("Age Demographic")["Price"].count()
price_cnt.head()

Age Demographic
0-9       33
10-14     38
15-19    144
20-24    372
25-29    134
Name: Price, dtype: int64

In [588]:
demographic_df = pd.DataFrame({"Revenue":price_sum,
                                   "Sales":price_cnt})
demographic_df

                 Revenue  Sales
Age Demographic
0-9                97.28     33
10-14             105.91     38
15-19             416.83    144
20-24            1087.66    372
25-29             396.44    134
30-34             211.14     71
35-39             140.77     48
40-44              55.68     17
45-49               2.72      1

In [589]:
demographic_df["Average Sale"] = price_sum/price_cnt
demographic_df

                 Revenue  Sales  Average Sale
Age Demographic
0-9                97.28     33      2.947879
10-14             105.91     38      2.787105
15-19             416.83    144      2.894653
20-24            1087.66    372      2.923817
25-29             396.44    134      2.958507
30-34             211.14     71      2.973803
35-39             140.77     48      2.932708
40-44              55.68     17      3.275294
45-49               2.72      1      2.720000

In [590]:
big_spenders_df = heroe_df
big_spenders_df1 = big_spenders_df.groupby("SN")["Price"].sum().reset_index()

bs = big_spenders_df1.sort_values("Price", ascending=False)
bs = bs.rename(columns={"Price":"Total Purchases"})
bs2 = bs.head()
bs2

                SN  Total Purchases
574    Undirrala66            17.06
22   Aerithllora36            15.10
459       Saedue76            13.56
503       Sondim43            13.02
382    Mindimnya67            12.74

In [600]:
big_spenders_df2 = big_spenders_df.loc[(big_spenders_df["SN"]=="Undirrala66") + (big_spenders_df["SN"]=="Aerithllora36") + (big_spenders_df["SN"]=="Saedue76") + (big_spenders_df["SN"]=="Sondim43") + (big_spenders_df["SN"]=="Mindimnya67")]
big_spenders_df2 = big_spenders_df2.groupby("SN")["Price"].count().reset_index()
big_spenders_df2 = big_spenders_df2.rename(columns={"Price":"Sales Count"})
big_spenders_df2

C:\Users\mduke\Anaconda3\lib\site-packages\pandas\core\computation\expressions.py:183: UserWarning: evaluating in Python space because the '+' operator is not supported by numexpr for the bool dtype, use '|' instead
  unsupported[op_str]))

              SN  Sales Count
0  Aerithllora36            4
1    Mindimnya67            4
2       Saedue76            4
3       Sondim43            4
4    Undirrala66            5

In [604]:
top_customers_df = pd.merge(big_spenders_df2, bs2, how="outer", on="SN")
top_customers_df["Avg Purchase"] = top_customers_df["Total Purchases"]/top_customers_df["Sales Count"]
top_customers_df

              SN  Sales Count  Total Purchases  Avg Purchase
0  Aerithllora36            4            15.10         3.775
1    Mindimnya67            4            12.74         3.185
2       Saedue76            4            13.56         3.390
3       Sondim43            4            13.02         3.255
4    Undirrala66            5            17.06         3.412